In [1]:
import pandas as pd
print(pd.__version__)

1.5.3

In [4]:
import pandas as pd
x={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
df=pd.DataFrame(x)
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [8]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [10]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [13]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.head(3))
print(df.iloc[:3])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [17]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.iloc[:,:2])
print('....................................................')
print(df[['name','score']])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0
....................................................
        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [20]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.iloc[[1,3,5,6],[1,3]])

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

In [21]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df[df['attempts']>2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [23]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.shape)
total_rows=len(df.axes[0])
total_cols=len(df.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

(10, 4)
Number of Rows: 10
Number of Columns: 4

In [25]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df[df['score'].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [27]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df[df['score'].between(15,20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [35]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df[(df['score']>15) & (df['attempts']<2)])

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [42]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df)
print('...................................................')
df.loc['d','score']=11.5
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
...................................................
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [46]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.iloc[:,2].sum())
print('.....................................')
print(df['attempts'].sum())

19
.....................................
19

In [48]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.iloc[:,1].mean())
print('.....................................')
print(df['score'].mean())

13.5625
.....................................
13.5625

In [52]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df)
print('..................................................................')
df.loc['k']=[1,'Suresh','yes',15.5]
print(df)
print('................................................................')
df=df.drop('k')
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
..................................................................
        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima     9.0        3      no
c  Katherine    16.5        2     yes
d      James     NaN        3      no
e      Emily     9.0        2      no
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
j      Jonas    19.0        1     yes
k          1  Suresh      yes    15.5
................................................................
        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

In [6]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df)
print('..........................................................')
df=df.sort_values(by=['name','score'],ascending=[False,True])
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
..........................................................
        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

In [7]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df['qualify']=df['qualify'].map({'yes':True,'no':False})
df

        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

In [10]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df['name']=df['name'].replace('James','Suresh')
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d     Suresh    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [16]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.pop('attempts')
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [18]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color']=color
df

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

In [20]:
import pandas as pd
import numpy as np
exam_data=[{'name':'Pawan Yadav','score':80.4},{'name':'Amit','score':79.4},{'name':'Pankaj Yadav','score':75.4}]
df=pd.DataFrame(exam_data)
print(df)
for i,j in df.iterrows():
    print(j['name'],j['score'])

           name  score
0   Pawan Yadav   80.4
1          Amit   79.4
2  Pankaj Yadav   75.4
Pawan Yadav 80.4
Amit 79.4
Pankaj Yadav 75.4

In [24]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(list(df.columns.values))

['name', 'score', 'attempts', 'qualify']

In [8]:
import pandas as pd
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df=pd.DataFrame(d)
print(df)
df.columns=['Column1','Column2','Column3']
print(df)
df=df.rename(columns={'col1': 'Column1', 'col2': 'Column2', 'col3': 'Column3'})
print(df)

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

In [3]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df.loc[df['col1']==4])

   col1  col2  col3
1     4     5     8
3     4     7     0

In [6]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df=df[['col3','col2','col1']]
df

   col3  col2  col1
0     7     4     1
1     8     5     4
2     9     6     3
3     0     7     4
4     1     8     5

In [10]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.loc[5]=[10,11,12]
print(df)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
5    10    11    12

In [13]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.to_csv('G:/dataset/analysis/sample.csv',sep='\t',index=False)
df2=pd.read_csv('G:/dataset/analysis/sample.csv')
df2

  name\tscore\tattempts\tqualify
0        Anastasia\t12.5\t1\tyes
1               Dima\t9.0\t3\tno
2        Katherine\t16.5\t2\tyes
3                 James\t\t3\tno
4              Emily\t9.0\t2\tno
5          Michael\t20.0\t3\tyes
6          Matthew\t14.5\t1\tyes
7                 Laura\t\t1\tno
8              Kevin\t8.0\t2\tno
9            Jonas\t19.0\t1\tyes

In [14]:
import pandas as pd
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1=df1.groupby(['city']).size().reset_index(name='Number of people')
g1

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

In [18]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df)
df=df[df.col2 !=5]
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [2]:
import pandas as pd
import numpy as np
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)
print("Original DataFrame")
print(df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [5]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df)
df.iloc[[2]]

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

   col1  col2  col3
2     3     6     9

In [9]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df=df.fillna(0)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    0.0         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    0.0         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [11]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.reset_index(level=0,inplace=True)
print(df)
print("\nHiding index:")
print( df.to_string(index=False))

  index       name  score  attempts qualify
0     a  Anastasia   12.5         1     yes
1     b       Dima    9.0         3      no
2     c  Katherine   16.5         2     yes
3     d      James    NaN         3      no
4     e      Emily    9.0         2      no
5     f    Michael   20.0         3     yes
6     g    Matthew   14.5         1     yes
7     h      Laura    NaN         1      no
8     i      Kevin    8.0         2      no
9     j      Jonas   19.0         1     yes

Hiding index:
index      name  score  attempts qualify
    a Anastasia   12.5         1     yes
    b      Dima    9.0         3      no
    c Katherine   16.5         2     yes
    d     James    NaN         3      no
    e     Emily    9.0         2      no
    f   Michael   20.0         3     yes
    g   Matthew   14.5         1     yes
    h     Laura    NaN         1      no
    i     Kevin    8.0         2      no
    j     Jonas   19.0         1     yes

In [14]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.at['i', 'score'] = 10.2  # Update score for 'i' label
print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin   10.2         2      no
j      Jonas   19.0         1     yes

In [1]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.isnull().values.sum()

2

In [6]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df=df.drop([2,4])
df

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

In [4]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df=pd.DataFrame(exam_data)
df=df.drop(df.index[[1,2]])
print(df)
df=df.reset_index()
print(df)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes
   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

In [5]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(10, 2))
print(df)
part_70 = df.sample(frac=0.7,random_state=10)
part_30 = df.drop(part_70.index)
print(part_70)
print(part_30)

          0         1
0 -1.862554  0.560564
1 -0.835772 -0.602953
2  0.076452 -0.913932
3  0.407229  0.241564
4 -0.996993  0.833686
5 -0.852778  0.503790
6 -0.264317 -0.076690
7  1.694258  0.113441
8  0.635274 -1.087894
9 -2.785044  0.034806
          0         1
8  0.635274 -1.087894
2  0.076452 -0.913932
5 -0.852778  0.503790
6 -0.264317 -0.076690
3  0.407229  0.241564
1 -0.835772 -0.602953
0 -1.862554  0.560564
          0         1
4 -0.996993  0.833686
7  1.694258  0.113441
9 -2.785044  0.034806

In [11]:
x=pd.Series(['100', '200', 'python', '300.12', '400'])
y=pd.Series(['10', '20', 'php', '30.12', '40'])
z=pd.concat([x,y],axis=1)
print(z)

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

In [12]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.sample(frac=1))

        name  score  attempts qualify
h      Laura    NaN         1      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
a  Anastasia   12.5         1     yes
f    Michael   20.0         3     yes
d      James    NaN         3      no
j      Jonas   19.0         1     yes
g    Matthew   14.5         1     yes

In [14]:
import pandas as pd
import numpy as np
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print(s)
r = pd.to_datetime(pd.Series(s))
df = pd.DataFrame(r)
print(df)

0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

In [18]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df=df.rename(columns={'col2':'Column2'})
df

   col1  Column2  col3
0     1        4     7
1     4        5     8
2     3        6     9
3     4        7     0
4     5        8     1

In [19]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
d=df['col2'].tolist()
print(d)

[4, 5, 6, 7, 8]

In [27]:
import pandas as pd
import numpy as np
dtype = [('Column1','int32'), ('Column2','float32'), ('Column3','float32')]
values=np.zeros(15,dtype=dtype)
index = ['Index'+str(i) for i in range(1, len(values)+1)]
df = pd.DataFrame(values, index=index)
print(df)

         Column1  Column2  Column3
Index1         0      0.0      0.0
Index2         0      0.0      0.0
Index3         0      0.0      0.0
Index4         0      0.0      0.0
Index5         0      0.0      0.0
Index6         0      0.0      0.0
Index7         0      0.0      0.0
Index8         0      0.0      0.0
Index9         0      0.0      0.0
Index10        0      0.0      0.0
Index11        0      0.0      0.0
Index12        0      0.0      0.0
Index13        0      0.0      0.0
Index14        0      0.0      0.0
Index15        0      0.0      0.0

In [29]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df['col1'].argmax())
print(df['col2'].argmax())
print(df['col3'].argmax())

4
4
2

In [33]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print('col4' in df)
print('col1' in df)
if 'col4' in df.columns:
    print("Col4 is present in DataFrame.")
else:
    print("Col4 is not present in DataFrame.")
if 'col1' in df.columns:
    print("Col1 is present in DataFrame.")
else:
    print("Col1 is not present in DataFrame.")

False
True
Col4 is not present in DataFrame.
Col1 is present in DataFrame.

In [42]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df)
print(df.iloc[0])
print(df.iloc[3])

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1
col1    1
col2    4
col3    7
Name: 0, dtype: int64
col1    4
col2    7
col3    0
Name: 3, dtype: int64

In [44]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
print(df.dtypes)

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [57]:
import pandas as pd
import numpy as np
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
df = df.append(data)
print(df)

   col1  col2
0     0     0
1     1     1
2     2     2

C:\Users\panka\AppData\Local\Temp\ipykernel_17856\3806651618.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(data)

In [58]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.sort_values(['attempts','name'],ascending=[True,True])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
j      Jonas   19.0         1     yes
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
e      Emily    9.0         2      no
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
b       Dima    9.0         3      no
d      James    NaN         3      no
f    Michael   20.0         3     yes

In [64]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, 12.77, 9, 20, 14.5, 11.34, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index=labels)
df.score=df.score.astype(int)
print(df)
print(df.dtypes)

        name  score  attempts qualify
a  Anastasia     12         1     yes
b       Dima      9         3      no
c  Katherine     16         2     yes
d      James     12         3      no
e      Emily      9         2      no
f    Michael     20         3     yes
g    Matthew     14         1     yes
h      Laura     11         1      no
i      Kevin      8         2      no
j      Jonas     19         1     yes
name        object
score        int32
attempts     int64
qualify     object
dtype: object

In [65]:
import pandas as pd
import numpy as np
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
print(df)
df = df.replace([np.inf, -np.inf], np.nan)
print(df)

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf
        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

In [67]:
import pandas as pd
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
print(df)
new_col = [1, 2, 3, 4, 7]  
idx = 0
df.insert(loc=idx, column='col1', value=new_col)
print(df)

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [71]:
import pandas as pd
x=[['col1', 'col2'], [2, 4], [1, 3]]
headers=x.pop(0)
df=pd.DataFrame(x,columns=headers)
df

   col1  col2
0     2     4
1     1     3

In [72]:
import pandas as pd
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
print(df)
df = df.groupby('col1')['col2'].apply(list)
print(df)

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

In [73]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.columns.get_loc('col2')

1

In [79]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
print(df.columns.value_counts().sum())
print(len(df.columns))

3
3

In [81]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df = df.loc[:, df.columns != 'col3']
print(df)
df.iloc[:,:2]

   col1  col2
0     1     4
1     4     5
2     3     6
3     4     7
4     5     8

   col1  col2
0     1     4
1     4     5
2     3     6
3     4     7
4     5     8

In [83]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.head(3)

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

In [86]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.tail(3)

   col1  col2  col3
2     3     6     9
3     4     7     0
4     5     8     1

In [89]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df1 = df.nlargest(3, 'col1')
print(df1)
df2 = df.nlargest(3, 'col2')
print(df2)
df3 = df.nlargest(3, 'col3')
print(df3)

   col1  col2  col3
4     5     8     1
1     4     5     8
3     4     7     0
   col1  col2  col3
4     5     8     1
3     4     7     0
2     3     6     9
   col1  col2  col3
2     3     6     9
1     4     5     8
0     1     4     7

In [90]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.iloc[3:]

   col1  col2  col3
3     4     7     0
4     5     8     1

In [96]:
import pandas as pd
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df=pd.DataFrame(d)
df.iloc[:3]

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

In [97]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)
print(df.add_prefix("A_"))
print(df.add_suffix("_1"))

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
   A_W  A_X  A_Y  A_Z
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83
   W_1  X_1  Y_1  Z_1
0   68   78   84   86
1   75   85   94   97
2   86   96   89   96
3   80   80   83   72
4   66   86   86   83

In [99]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)
print(df.iloc[:,::-1])
print(df.iloc[::-1])
print(df.iloc[::-1].reset_index(drop=True))

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
    Z   Y   X   W
0  86  84  78  68
1  97  94  85  75
2  96  89  96  86
3  72  83  80  80
4  83  86  86  66
    W   X   Y   Z
4  66  86  86  83
3  80  80  83  72
2  86  96  89  96
1  75  85  94  97
0  68  78  84  86
    W   X   Y   Z
0  66  86  86  83
1  80  80  83  72
2  86  96  89  96
3  75  85  94  97
4  68  78  84  86

In [100]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)
print(df.select_dtypes(include = "number"))
print(df.select_dtypes(include = "object"))

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0
    age
0  18.5
1  21.2
2  22.5
3  22.0
4  23.0
             name date_of_birth
0  Alberto Franco    17/05/2002
1    Gino Mcneill    16/02/1999
2     Ryan Parkes    25/09/1998
3    Eesha Hinton    11/05/2002
4    Syed Wharton    15/09/1997

In [102]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': ['18', '21', '22', '22', '23']
})
df_1 = df.sample(frac = 0.6)
df_2 = df.drop(df_1.index)
print(df)
print(df.shape)
print(df_1)
print(df_1.shape)
print(df_2)
print(df_2.shape)

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23
(5, 3)
           name date_of_birth age
4  Syed Wharton    15/09/1997  23
2   Ryan Parkes    25/09/1998  22
3  Eesha Hinton    11/05/2002  22
(3, 3)
             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
(2, 3)

In [106]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': ['18', '21', '22', '22', '23']
})
print(df)
df.columns = df.columns.str.lower().str.rstrip()
df.head()

             Name Date_Of_Birth  Age
0  Alberto Franco     17/05/2002  18
1    Gino Mcneill     16/02/1999  21
2     Ryan Parkes     25/09/1998  22
3    Eesha Hinton     11/05/2002  22
4    Syed Wharton     15/09/1997  23

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23

In [108]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': ['18', '21', '22', '22', '23']
})
print(df)
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])
print(df)
print(df1)
df_one_to_one = pd.merge(df, df1, validate = "one_to_one")
print(df_one_to_one)
df_one_to_many = pd.merge(df, df1, validate = "one_to_many")
print(df_one_to_many)
df_many_to_one = pd.merge(df, df1, validate = "many_to_one")
print(df_many_to_one)

             Name Date_Of_Birth  Age
0  Alberto Franco     17/05/2002  18
1    Gino Mcneill     16/02/1999  21
2     Ryan Parkes     25/09/1998  22
3    Eesha Hinton     11/05/2002  22
4    Syed Wharton     15/09/1997  23
           Name Date_Of_Birth  Age
2   Ryan Parkes     25/09/1998  22
3  Eesha Hinton     11/05/2002  22
4  Syed Wharton     15/09/1997  23
             Name Date_Of_Birth  Age
0  Alberto Franco     17/05/2002  18
1    Gino Mcneill     16/02/1999  21
3    Eesha Hinton     11/05/2002  22
4    Syed Wharton     15/09/1997  23
           Name Date_Of_Birth  Age
0  Eesha Hinton     11/05/2002  22
1  Syed Wharton     15/09/1997  23
           Name Date_Of_Birth  Age
0  Eesha Hinton     11/05/2002  22
1  Syed Wharton     15/09/1997  23
           Name Date_Of_Birth  Age
0  Eesha Hinton     11/05/2002  22
1  Syed Wharton     15/09/1997  23

In [7]:
import pandas as pd
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'age': [18, 21, 82, 85, 30]
})
print(df)
print('\nAge group:')
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
print(df["age_groups"])

             name  age
0  Alberto Franco   18
1    Gino Mcneill   21
2     Ryan Parkes   82
3    Eesha Hinton   85
4    Syed Wharton   30

Age group:
0       kids
1      adult
2    elderly
3    elderly
4      adult
Name: age_groups, dtype: category
Categories (3, object): ['kids' < 'adult' < 'elderly']

In [8]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)
print(df.info(memory_usage = "deep"))
print(df.memory_usage(deep = True))

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Date_Of_Birth   5 non-null      object
 2   Age             5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 853.0 bytes
None
Index             132
Name              346
Date_Of_Birth     335
Age                40
dtype: int64

In [10]:
import pandas as pd
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])
print(sr1)
print(sr2)
ser_df = pd.DataFrame(sr1, sr2).reset_index()
print(ser_df.head())
ser_df = pd.concat([sr1, sr2], axis = 1)
print(ser_df.head())
ser_df = pd.DataFrame({"col1":sr1, "col2":sr2})
print(ser_df.head(5))

0       php
1    python
2      java
3        c#
4       c++
dtype: object
0    1
1    2
2    3
3    4
4    5
dtype: int64
   index       0
0      1  python
1      2    java
2      3      c#
3      4     c++
4      5     NaN
        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5
     col1  col2
0     php     1
1  python     2
2    java     3
3      c#     4
4     c++     5

In [13]:
import pandas as pd
df1 = pd.util.testing.makeDataFrame() # contains random values
print(df1)
df2 = pd.util.testing.makeMissingDataframe() # contains missing values
print(df2)
df3 = pd.util.testing.makeTimeDataFrame() # contains datetime values
print(df3)
df4 = pd.util.testing.makeMixedDataFrame() # contains mixed values
print(df4)

                   A         B         C         D
3LaE6swqF6 -0.765828 -1.567730 -0.475660 -0.457682
LBQ5142jzh  0.392526  0.462572  0.134897  0.449384
aER3KDWUsd -1.468269  0.081849  1.553421  1.402745
mJyU2pQMGf -0.644999 -0.560218 -2.170899 -0.342253
BImH9aOT6A  0.814072 -0.400689 -0.070023 -0.377222
unDl39Hodn -1.054264 -0.835850  0.341636  1.053023
ZMLiLgQRAD  1.482901 -0.078176 -0.392889 -0.727664
E96HRkYEz5 -0.803617 -0.931082 -1.305004  0.842390
P7pbVlkiA4 -0.416589  0.974852  0.814273  1.655567
dOok2cGKyn -1.198240  0.583309 -0.525226  1.080219
TzUsKkqVNz  2.114872  0.799185  0.664545 -1.175737
SKwzz7ugjq  1.086970 -0.222692 -0.596186  0.867323
Nt30QXwd4B  1.381192  0.131538  0.166484 -0.752517
TIaCX2lfUo -0.388149 -1.119475  0.004379 -0.157984
dOloG1029X  1.013348  0.321884 -1.768570  0.841635
opV1EDKaPH  1.710713  0.285932  0.566184 -0.105237
HpcI1sdvFZ  1.804185  0.844075 -0.124324 -0.602198
d7uJ8YbeCE -0.202583 -1.289831  0.136802  1.080375
ok6M5Dnu3w -0.208288  1.479312  0.138256 -0.641251
vuaPkhVUvS -0.525054 -0.662080  0.164338 -0.200888
JNlIgw0gHA -0.759703  0.274349  0.022532  1.718352
YAHCnPjNph  0.617130 -0.294742  2.291912 -0.225020
j8WRSxbN22  0.432163  2.211358 -0.701684 -1.608567
bbdni0IEyp -0.035564 -3.892316  0.769492 -1.147450
FPxQ3qNOJi  0.189266 -0.606472 -0.673830  0.299493
jBWx4OfoG2  1.163695 -0.983331 -1.060535  0.372946
5vsXOtboed -0.398808 -1.306631 -1.236731  2.026692
LeNFmTCwZ8 -1.772727 -1.034988 -0.061151  0.175745
FrR5eAFIaW -3.199156  0.585892  0.311484 -2.350293
9kG5DvrYoK -0.698715  0.147249  0.432111  0.780476
                   A         B         C         D
BW9m6zJzBH -0.219312 -0.462358 -0.458728 -1.021989
qUleqm4rkM -1.522458  0.763430 -0.074936  0.694253
Tv51dYA2Bs  0.166850  0.058851  0.983810  1.363305
tmPDekzx44 -0.724954  0.272489  0.037934       NaN
EIP3eNKSvl  1.214583 -1.037243 -0.834158  0.056361
hMoXBNloT9  0.122401  0.523569 -1.644748 -1.400245
270Z9SZtM6  0.300343 -1.510756       NaN -1.468738
jlCd4TTMwD  0.690648 -0.279296  0.360693 -0.143465
55FIw3CR7o       NaN       NaN -0.010477 -2.046362
cedMRyDYpx -0.317916 -0.669245  0.174372  1.504881
UpL53CSuYU -1.204264 -0.339991 -1.906141       NaN
SS5a6Rzpen  1.018033  0.475170  1.321381       NaN
srTH9JSe3a -1.785983  0.679646       NaN  0.558533
C7pS8PeXba -0.673267 -0.843125 -0.600252 -1.898213
qPqkQ3WDaT -0.602995       NaN  2.020848 -0.239547
YcwvjqtBEz  2.996081  1.222338 -0.947203  2.260933
3fhhjyDVQG  0.255520 -0.594258 -1.624350 -1.399866
VjUOVfCnSA  1.257254  0.326583  0.518589 -0.480934
ePj6y2PNxo -0.860309  1.630492 -0.453667 -0.894125
opXC9PK2qr -1.146839 -1.884105 -1.464043 -0.571113
k4ikVYORnu -1.046514 -2.016424  1.353233 -0.215553
EQq4JqWY7q -0.219918  0.549476  0.668602  1.098715
wxdU4uOXgO -0.277838  0.921620 -0.379285       NaN
SZePRCnDHJ -0.492584  0.876836 -0.586584 -0.511598
LezTwPC0oj -0.126590 -0.925116 -0.967162       NaN
OubUwBW6HW  1.430304  1.144790       NaN -0.168114
ykFJsSdRrz -0.019777  0.801257 -0.348922 -0.551848
cyDt4t9syJ  0.401114 -0.971516 -0.358767  0.120156
8UbxV3VXHo  1.442166       NaN -0.272963 -0.409319
0Djpw65XYx -0.469788  0.006241  0.029066 -1.801923
                   A         B         C         D
2000-01-03  1.774266 -0.854581 -1.726716  1.911362
2000-01-04 -1.466500 -0.667945  0.750082 -0.677915
2000-01-05  0.989022 -1.181759  2.061469  0.901008
2000-01-06 -0.704619 -0.519140 -1.456126 -0.249577
2000-01-07  0.089930 -0.366165  0.603329 -0.624333
2000-01-10  0.750107 -2.091146  1.130414  1.457324
2000-01-11 -0.727300 -1.071580 -0.293239  0.035489
2000-01-12  0.980058  0.542489 -0.684291  0.857832
2000-01-13  0.006152  0.026034 -0.519272  0.840613
2000-01-14 -0.819924  0.646577  0.224765 -0.395243
2000-01-17  1.104310 -1.137928  1.125989  0.464072
2000-01-18  0.264322 -0.880607 -0.995051  1.505601
2000-01-19  1.756381 -0.194925  0.291736 -0.301405
2000-01-20  0.442647  1.647121  1.668472 -2.570788
2000-01-21  0.144585 -1.913662  0.893101 -2.678684
2000-01-24 -0.320994  1.089929  2.023197 -0.628083
2000-01-25 -0.864689 -0.009491  1.308585 -0.355678
2000-01-26  0.287306 -0.146223  2.317384 -1.351265
2000-01-27 -1.663657  1.583115  0.032367  1.658856
2000-01-28 -0.479466 -0.331485  0.290560 -0.578675
2000-01-31 -1.505413  1.832043  0.273387  0.659490
2000-02-01  1.347961 -0.566439 -1.009379 -0.416630
2000-02-02 -0.398517  1.259925 -0.103134  0.348867
2000-02-03  1.845120 -1.263536 -1.192223 -0.502499
2000-02-04  0.050573 -0.711523  0.208598 -0.613128
2000-02-07  0.420119  0.126743  1.294264 -0.268612
2000-02-08 -1.243750 -0.968255 -0.501260  0.083145
2000-02-09 -0.319099 -2.278188 -0.614498 -0.940231
2000-02-10 -2.525220  0.141365 -0.843722 -1.205661
2000-02-11  1.241938  0.407506  0.226115  0.679876
     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [14]:
import pandas as pd
import numpy as np
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df.index = pd.util.testing.makeDateIndex()[0:6]
print(df)
print(df.interpolate())

               c1    c2
2000-01-03  120.0   7.0
2000-01-04  130.0   NaN
2000-01-05  140.0  10.0
2000-01-06  150.0   NaN
2000-01-07    NaN   5.5
2000-01-10  170.0  16.5
               c1     c2
2000-01-03  120.0   7.00
2000-01-04  130.0   8.50
2000-01-05  140.0  10.00
2000-01-06  150.0   7.75
2000-01-07  160.0   5.50
2000-01-10  170.0  16.50

In [15]:
import pandas as pd
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df)
maxx = df["W"].max()
print(df.query("W < @maxx"))

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83
    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

In [16]:
import pandas as pd
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
df = pd.DataFrame(d)
print(df)
print(df["purchase"].apply(type))
df["purchase"] = df["purchase"].replace("[$,]", "", regex = True).astype("float")
print(df["purchase"].apply(type))

  agent  purchase
0  a001    4500.0
1  a002    7500.0
2  a003  $3000.25
3  a003  $1250.35
4  a004   9000.00
0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object
0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

In [17]:
import pandas as pd
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
print(df)
label1, unique1 = pd.factorize(df['Name'])
print(label1)
print(unique1)

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0
[0 1 2 3 1]
Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

In [18]:
import pandas as pd
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
print(df1)
df1['rnum']=df1.rnum.where(df1.rnum.eq(df1.rnum.cummax()),0)
print(df1)

    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19
    rnum
0     23
1      0
2     27
3      0
4     34
5      0
6     34
7      0
8      0
9      0
10    34
11     0
12     0
13     0
14     0

In [25]:
import pandas as pd
# df = pd.read_clipboard()
# print(df)

In [26]:
import pandas as pd
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});
print(df1)
print(df2)
print(df1.ne(df2))

      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  85.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  83  72
4   NaN  86.0  86  83
      W   X   Y   Z
0  78.0  78  84  86
1  75.0  85  84  97
2  86.0  96  89  96
3  80.0  80  83  72
4   NaN  76  86  83
       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

In [28]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
print(df)
df1 = df.nsmallest(3, 'col1')
print(df1)
df2 = df.nsmallest(4, 'col2')
print(df2)
df3 = df.nsmallest(3, 'col3')
print(df3)

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
   col1  col2  col3
5    11     0    11
0     1     4     7
1     2     5     5
4     7     5     1
   col1  col2  col3
4     7     5     1
1     2     5     5
0     1     4     7